WebDust21/framework-cmsis-atmelsam/samv71_rt/include/samv71q21rt.h
/* ************************************************************************** */
/*                  BASE ADDRESS DEFINITIONS FOR SAMV71Q21RT                  */
/* ************************************************************************** */
#define ACC_BASE_ADDRESS                 _UINT32_(0x40044000)                          /* ACC Base Address */
#define AES_BASE_ADDRESS                 _UINT32_(0x4006c000)                          /* AES Base Address */
#define AFEC0_BASE_ADDRESS               _UINT32_(0x4003c000)                          /* AFEC0 Base Address */
#define AFEC1_BASE_ADDRESS               _UINT32_(0x40064000)                          /* AFEC1 Base Address */
#define CHIPID_BASE_ADDRESS              _UINT32_(0x400e0940)                          /* CHIPID Base Address */
#define DACC_BASE_ADDRESS                _UINT32_(0x40040000)                          /* DACC Base Address */
#define EFC_BASE_ADDRESS                 _UINT32_(0x400e0c00)                          /* EFC Base Address */
#define GMAC_BASE_ADDRESS                _UINT32_(0x40050000)                          /* GMAC Base Address */
#define GPBR_BASE_ADDRESS                _UINT32_(0x400e1890)                          /* GPBR Base Address */
#define HSMCI_BASE_ADDRESS               _UINT32_(0x40000000)                          /* HSMCI Base Address */
#define I2SC0_BASE_ADDRESS               _UINT32_(0x4008c000)                          /* I2SC0 Base Address */
#define I2SC1_BASE_ADDRESS               _UINT32_(0x40090000)                          /* I2SC1 Base Address */
#define ICM_BASE_ADDRESS                 _UINT32_(0x40048000)                          /* ICM Base Address */
#define ISI_BASE_ADDRESS                 _UINT32_(0x4004c000)                          /* ISI Base Address */
#define MATRIX_BASE_ADDRESS              _UINT32_(0x40088000)                          /* MATRIX Base Address */
#define MCAN0_BASE_ADDRESS               _UINT32_(0x40030000)                          /* MCAN0 Base Address */
#define MCAN1_BASE_ADDRESS               _UINT32_(0x40034000)                          /* MCAN1 Base Address */
#define MLB_BASE_ADDRESS                 _UINT32_(0x40068000)                          /* MLB Base Address */
#define PIOA_BASE_ADDRESS                _UINT32_(0x400e0e00)                          /* PIOA Base Address */
#define PIOB_BASE_ADDRESS                _UINT32_(0x400e1000)                          /* PIOB Base Address */
#define PIOC_BASE_ADDRESS                _UINT32_(0x400e1200)                          /* PIOC Base Address */
#define PIOD_BASE_ADDRESS                _UINT32_(0x400e1400)                          /* PIOD Base Address */
#define PIOE_BASE_ADDRESS                _UINT32_(0x400e1600)                          /* PIOE Base Address */
#define PMC_BASE_ADDRESS                 _UINT32_(0x400e0600)                          /* PMC Base Address */
#define PWM0_BASE_ADDRESS                _UINT32_(0x40020000)                          /* PWM0 Base Address */
#define PWM1_BASE_ADDRESS                _UINT32_(0x4005c000)                          /* PWM1 Base Address */
#define QSPI_BASE_ADDRESS                _UINT32_(0x4007c000)                          /* QSPI Base Address */
#define RSTC_BASE_ADDRESS                _UINT32_(0x400e1800)                          /* RSTC Base Address */
#define RSWDT_BASE_ADDRESS               _UINT32_(0x400e1900)                          /* RSWDT Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x400e1860)                          /* RTC Base Address */
#define RTT_BASE_ADDRESS                 _UINT32_(0x400e1830)                          /* RTT Base Address */
#define SDRAMC_BASE_ADDRESS              _UINT32_(0x40084000)                          /* SDRAMC Base Address */
#define SMC_BASE_ADDRESS                 _UINT32_(0x40080000)                          /* SMC Base Address */
#define SPI0_BASE_ADDRESS                _UINT32_(0x40008000)                          /* SPI0 Base Address */
#define SPI1_BASE_ADDRESS                _UINT32_(0x40058000)                          /* SPI1 Base Address */
#define SSC_BASE_ADDRESS                 _UINT32_(0x40004000)                          /* SSC Base Address */
#define SUPC_BASE_ADDRESS                _UINT32_(0x400e1810)                          /* SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UINT32_(0x4000c000)                          /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x40010000)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x40014000)                          /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UINT32_(0x40054000)                          /* TC3 Base Address */
#define TRNG_BASE_ADDRESS                _UINT32_(0x40070000)                          /* TRNG Base Address */
#define TWIHS0_BASE_ADDRESS              _UINT32_(0x40018000)                          /* TWIHS0 Base Address */
#define TWIHS1_BASE_ADDRESS              _UINT32_(0x4001c000)                          /* TWIHS1 Base Address */
#define TWIHS2_BASE_ADDRESS              _UINT32_(0x40060000)                          /* TWIHS2 Base Address */
#define UART0_BASE_ADDRESS               _UINT32_(0x400e0800)                          /* UART0 Base Address */
#define UART1_BASE_ADDRESS               _UINT32_(0x400e0a00)                          /* UART1 Base Address */
#define UART2_BASE_ADDRESS               _UINT32_(0x400e1a00)                          /* UART2 Base Address */
#define UART3_BASE_ADDRESS               _UINT32_(0x400e1c00)                          /* UART3 Base Address */
#define UART4_BASE_ADDRESS               _UINT32_(0x400e1e00)                          /* UART4 Base Address */
#define USART0_BASE_ADDRESS              _UINT32_(0x40024000)                          /* USART0 Base Address */
#define USART1_BASE_ADDRESS              _UINT32_(0x40028000)                          /* USART1 Base Address */
#define USART2_BASE_ADDRESS              _UINT32_(0x4002c000)                          /* USART2 Base Address */
#define USBHS_BASE_ADDRESS               _UINT32_(0x40038000)                          /* USBHS Base Address */
#define UTMI_BASE_ADDRESS                _UINT32_(0x400e0400)                          /* UTMI Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x400e1850)                          /* WDT Base Address */
#define XDMAC_BASE_ADDRESS               _UINT32_(0x40078000)                          /* XDMAC Base Address */
#define GPNVMBITS_BASE_ADDRESS           _UINT32_(0x00000000)                          /* FUSES Base Address */

/* ************************************************************************** */
/*                      PIO DEFINITIONS FOR SAMV71Q21RT                       */
/* ************************************************************************** */
#include "pio/samv71q21rt.h"

/* ************************************************************************** */
/*                 MEMORY MAPPING DEFINITIONS FOR SAMV71Q21RT                 */
/* ************************************************************************** */
#define PERIPHERALS_SIZE               _UINT32_(0x20000000)    /* 524288kB Memory segment type: io */
#define SYSTEM_SIZE                    _UINT32_(0x10000000)    /* 262144kB Memory segment type: io */
#define QSPIMEM_SIZE                   _UINT32_(0x20000000)    /* 524288kB Memory segment type: other */
#define AXIMX_SIZE                     _UINT32_(0x00100000)    /* 1024kB Memory segment type: other */
#define ITCM_SIZE                      _UINT32_(0x00020000)    /*  128kB Memory segment type: other */
#define IFLASH_SIZE                    _UINT32_(0x00200000)    /* 2048kB Memory segment type: flash */
#define IFLASH_PAGE_SIZE               _UINT32_(       512)
#define IFLASH_NB_OF_PAGES             _UINT32_(      4096)

#define IROM_SIZE                      _UINT32_(0x00004000)    /*   16kB Memory segment type: rom */
#define DTCM_SIZE                      _UINT32_(0x00020000)    /*  128kB Memory segment type: other */
#define IRAM_SIZE                      _UINT32_(0x00060000)    /*  384kB Memory segment type: ram */
#define EBI_CS0_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: other */
#define EBI_CS1_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: other */
#define EBI_CS2_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: other */
#define EBI_CS3_SIZE                   _UINT32_(0x01000000)    /* 16384kB Memory segment type: other */
#define SDRAM_CS_SIZE                  _UINT32_(0x10000000)    /* 262144kB Memory segment type: other */

#define PERIPHERALS_ADDR               _UINT32_(0x40000000)    /* PERIPHERALS base address (type: io)*/
#define SYSTEM_ADDR                    _UINT32_(0xe0000000)    /* SYSTEM base address (type: io)*/
#define QSPIMEM_ADDR                   _UINT32_(0x80000000)    /* QSPIMEM base address (type: other)*/
#define AXIMX_ADDR                     _UINT32_(0xa0000000)    /* AXIMX base address (type: other)*/
#define ITCM_ADDR                      _UINT32_(0x00000000)    /* ITCM base address (type: other)*/
#define IFLASH_ADDR                    _UINT32_(0x00400000)    /* IFLASH base address (type: flash)*/
#define IROM_ADDR                      _UINT32_(0x00800000)    /* IROM base address (type: rom)*/
#define DTCM_ADDR                      _UINT32_(0x20000000)    /* DTCM base address (type: other)*/
#define IRAM_ADDR                      _UINT32_(0x20400000)    /* IRAM base address (type: ram)*/
#define EBI_CS0_ADDR                   _UINT32_(0x60000000)    /* EBI_CS0 base address (type: other)*/
#define EBI_CS1_ADDR                   _UINT32_(0x61000000)    /* EBI_CS1 base address (type: other)*/
#define EBI_CS2_ADDR                   _UINT32_(0x62000000)    /* EBI_CS2 base address (type: other)*/
#define EBI_CS3_ADDR                   _UINT32_(0x63000000)    /* EBI_CS3 base address (type: other)*/
#define SDRAM_CS_ADDR                  _UINT32_(0x70000000)    /* SDRAM_CS base address (type: other)*/

/* ************************************************************************** */
/*                     DEVICE SIGNATURES FOR SAMV71Q21RT                      */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UINT32_(0X05B3D03F)
#define CHIP_CIDR                      _UINT32_(0XA1220E01)
#define CHIP_EXID                      _UINT32_(0X00000002)

/* ************************************************************************** */
/*                   ELECTRICAL DEFINITIONS FOR SAMV71Q21RT                   */
/* ************************************************************************** */
#define CHIP_FREQ_SLCK_RC_MIN          _UINT32_(20000)     
#define CHIP_FREQ_SLCK_RC              _UINT32_(32000)     /* Typical Slow Clock Internal RC frequency */
#define CHIP_FREQ_SLCK_RC_MAX          _UINT32_(44000)     
#define CHIP_FREQ_MAINCK_RC_4MHZ       _UINT32_(4000000)   
#define CHIP_FREQ_MAINCK_RC_8MHZ       _UINT32_(8000000)   
#define CHIP_FREQ_MAINCK_RC_12MHZ      _UINT32_(12000000)  
#define CHIP_FREQ_CPU_MAX              _UINT32_(300000000) 
#define CHIP_FREQ_XTAL_32K             _UINT32_(32768)     
#define CHIP_FREQ_XTAL_12M             _UINT32_(12000000)  
#define CHIP_FREQ_FWS_0                _UINT32_(23000000)  /* Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1                _UINT32_(46000000)  /* Maximum operating frequency when FWS is 1 */
#define CHIP_FREQ_FWS_2                _UINT32_(69000000)  /* Maximum operating frequency when FWS is 2 */
#define CHIP_FREQ_FWS_3                _UINT32_(92000000)  /* Maximum operating frequency when FWS is 3 */
#define CHIP_FREQ_FWS_4                _UINT32_(115000000) /* Maximum operating frequency when FWS is 4 */
#define CHIP_FREQ_FWS_5                _UINT32_(138000000) /* Maximum operating frequency when FWS is 5 */
#define CHIP_FREQ_FWS_6                _UINT32_(150000000) /* Maximum operating frequency when FWS is 6 */
#define CHIP_FREQ_FWS_NUMBER           _UINT32_(7)         /* Number of FWS ranges */

#ifdef __cplusplus
}
#endif

#endif /* _SAMV71Q21RT_H_ */

